ci4/app/Cells/ArtikelTerkini.php

    public function render($params = [])
    {
        try {
            $model = new ArtikelModel();

            // Query sederhana tanpa join untuk menghindari error
            $artikel = $model->select('id, judul, slug, created_at')
                           ->where('status', 'published')
                           ->orderBy('created_at', 'DESC')
                           ->limit(5)
                           ->findAll();
---
SELECT `id`, `judul`, `slug`, `created_at`
FROM `artikel`
WHERE `status` = 'published'
ORDER BY `created_at` DESC
 LIMIT 5