ci4/app/Views/layout/main.php

SELECT *
FROM `kategori`
---
    <ul>
        <?php
        $kategoriModel = new \App\Models\KategoriModel();
        $kategoris = $kategoriModel->findAll();