ci4/app/Controllers/AjaxController.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $kategoriModel = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
---
    public function getData()
    {
        $model = new ArtikelModel();

        // Gunakan Query Builder untuk mendapatkan data artikel dengan kategori
        $data = $model->db->table('artikel')
                    ->select('artikel.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
                    ->get()
                    ->getResultArray();