ci4/app/Controllers/Artikel.php


            // Fetch all categories for the filter dropdown
            $kategoriModel = new KategoriModel();
            $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function add()
    {
        // Cek login admin
        if (!session()->get('logged_in')) {
            return redirect()->to('/user/login');
        }

        // Load kategori data terlebih dahulu
        $kategoriModel = new KategoriModel();
        $data = [
            'title' => "Tambah Artikel",
            'kategori' => $kategoriModel->findAll(),
---
SELECT *
FROM `kategori`

    public function edit($id = null)
    {
        // Cek login admin
        if (!session()->get('logged_in')) {
            return redirect()->to('/user/login');
        }

        if (!$id || !is_numeric($id)) {
            throw new PageNotFoundException('Artikel tidak ditemukan.');
        }

        $model = new ArtikelModel();

        // Ambil data artikel
        $artikel = $model->find($id);
        if (!$artikel) {
            throw new PageNotFoundException('Artikel tidak ditemukan.');
        }

        // Load kategori data
        $kategoriModel = new KategoriModel();
        $data = [
            'title' => "Edit Artikel",
            'artikel' => $artikel,
            'kategori' => $kategoriModel->findAll(),
            'validation' => null
        ];
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '7'
SELECT *
FROM `kategori`