ci4/app/Controllers/Post.php

SELECT *
FROM `artikel`
WHERE `id` = '28'
 LIMIT 1
---
    public function show($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();