ci4/app/Controllers/User.php

SELECT COUNT(*) AS `numrows` FROM `artikel`
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `status` = 'published'
---
public function dashboard()
{
    // Pastikan user sudah login
    if (!session()->get('logged_in')) {
        return redirect()->to('/user/login');
    }

    $title = 'Dashboard Admin';
    $user_id = session()->get('user_id');
    $user_name = session()->get('user_name');

    // Ambil data artikel untuk ditampilkan di dashboard
    $artikelModel = new \App\Models\ArtikelModel();
    $artikel_count = $artikelModel->countAll();
    $artikel_published = $artikelModel->where('status', 'published')->countAllResults();